Q1. What is a database? Differentiate between SQL and NoSQL databases.

In [ ]:
"""A database is a structured collection of data. 
  SQL databases use a structured query language and have predefined schemas, 
  while NoSQL databases are non-relational and offer flexible schema design and scalability."""

Q2. What is DDL? Explain why CREATE, DROP, ALTER, and TRUNCATE are used with an example.

In [ ]:
"""DDL stands for Data Definition Language. 
   It is used to define and manage the structure of a database. 
   
   
   CREATE is used to create new objects
   Example:
    CREATE TABLE employees (
    name VARCHAR(50),
    age INT,
    salary DECIMAL(10,2)
    );


   DROP is used to remove objects
   Example:
     DROP TABLE employees;
     
     
   ALTER is used to modify objects
   Example:
     ALTER TABLE employees
     ADD COLUMN department VARCHAR(50);
     

   TRUNCATE is used to remove all data from a table.
   Example:
     TRUNCATE TABLE employees;
"""

Q3. What is DML? Explain INSERT, UPDATE, and DELETE with an example.

In [ ]:
"""DML stands for Data Manipulation Language, 
   a subset of SQL used to modify data in a database. 
   INSERT is used to add new records to a table, 
   UPDATE is used to modify existing records in a table, 
   and DELETE is used to remove records from a table.

   For example,table named "Employees" with columns "ID," "Name," and "Salary."

     INSERT statement: INSERT INTO Employees (ID, Name, Salary) VALUES (1, 'John', 5000) 
     adds a new employee with ID 1, name 'John', and salary 5000 to the Employees table.

     UPDATE statement: UPDATE Employees SET Salary = 6000 WHERE ID = 1 
     modifies the salary of the employee with ID 1 to 6000.

     DELETE statement: DELETE FROM Employees WHERE ID = 1 
     removes the employee with ID 1 from the Employees table."""

Q4. What is DQL? Explain SELECT with an example.

In [ ]:
"""DQL stands for Data Query Language, a subset of SQL. 
   SELECT is used to retrieve specific data from a database.
   
   Example: SELECT * FROM Customers retrieves all records from the Customers table."""

Q5. Explain Primary Key and Foreign Key.

In [ ]:
"""A primary key is a unique identifier for a record in a table, 
   ensuring its uniqueness and integrity.

   A foreign key is a reference to the primary key in another table, 
   establishing a relationship between the tables. It enforces referential integrity."""

Q6. Write a python code to connect MySQL to python. Explain the cursor() and execute() method.

In [18]:
!pip install mysql-connector
import mysql.connector
mydb = mysql.connector.connect(
  host="sql12.freesqldatabase.com",
  user="sql12625251",
  password="aDXmpqPsy6"
)
mycursor = mydb.cursor(buffered=True)
mycursor.execute("show databases")
mycursor.execute("CREATE TABLE if not exists sql12625251.test_table( c1 INT,c2 VARCHAR(50),c3 FLOAT,c4 INT,c5 VARCHAR(50));")
mycursor.execute("insert into sql12625251.test_table values(123,'shivam',234.45,234,'kumar')")
mycursor.execute("insert into sql12625251.test_table values(123,'shivam',234.45,234,'kumar')")
mycursor.execute("insert into sql12625251.test_table values(123,'shivam',234.45,234,'kumar')")
mycursor.execute("insert into sql12625251.test_table values(123,'shivam',234.45,234,'kumar')")
mycursor.execute("select * from sql12625251.test_table")
mydb.commit()
for i in mycursor.fetchall():
    print(i)    
mydb.close()

# cursor() execute() method.
"""The cursor() method is used to create a cursor object that executes SQL statements. 
   The execute() method is used to execute the SQL statement specified by the cursor object."""

Requirement already satisfied: mysql-connector in /opt/conda/lib/python3.10/site-packages (2.2.9)
(123, 'shivam', 234.45, 234, 'kumar')
(123, 'shivam', 234.45, 234, 'kumar')
(123, 'shivam', 234.45, 234, 'kumar')
(123, 'shivam', 234.45, 234, 'kumar')
(123, 'shivam', 234.45, 234, 'kumar')
(123, 'shivam', 234.45, 234, 'kumar')
(123, 'shivam', 234.45, 234, 'kumar')
(123, 'shivam', 234.45, 234, 'kumar')

Q7. Give the order of execution of SQL clauses in an SQL query.

In [ ]:
"""The order of execution of SQL clauses in an SQL query is as follows:

    1.FROM
    2.WHERE
    3.GROUP BY
    4.HAVING
    5.SELECT
    6.DISTINCT
    7.ORDER BY
    8.LIMIT/OFFSET  """